<?xml version="1.0" encoding="utf-8"?>
<policyDefinitionResources xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" revision="1.0" schemaVersion="1.0" xmlns="http://schemas.microsoft.com/GroupPolicy/2006/07/PolicyDefinitions">
  <displayName>Git Credential Manager Policy Settings</displayName>
  <description>Group Policy settings for Git Credential Manager.</description>
  <resources>
    <stringTable>
      <string id="SUPPORTED_GCM">Git Credential Manager (any version)</string>
      <string id="Cat_GitCredentialManager">Git Credential Manager</string>
      <string id="Cat_GCM_General">General</string>
      <string id="Cat_GCM_Tracing">Tracing</string>
      <string id="Cat_GCM_Credentials">Credential Storage</string>
      <string id="Cat_GCM_Authentication">Authentication</string>
      <string id="Cat_GCM_AzureRepos">Azure Repos</string>
      <string id="Cat_GCM_GitHub">GitHub</string>
      <string id="Cat_GCM_Bitbucket">Bitbucket</string>
      <string id="Cat_GCM_GitLab">GitLab</string>
      <string id="Cat_GCM_Trace2">Trace2</string>
      <string id="GCM_interactive">Interactive</string>
      <string id="GCM_interactive_Explain">Permit or disable GCM from interacting with the user (showing GUI or TTY
prompts). If interaction is required but has been disabled, an error is returned.

This can be helpful when using GCM in headless and unattended environments, such
as build servers, where it would be preferable to fail than to hang indefinitely
waiting for a non-existent user.

To disable interactivity set this to false or 0.

Corresponds to git config key: credential.interactive</string>
      <string id="GCM_trace">Trace</string>
      <string id="GCM_trace_Explain">Enables trace logging of all activities.
Configuring Git and GCM to trace to the same location is often desirable, and
GCM is compatible and cooperative with GIT_TRACE.

Corresponds to git config key: credential.trace</string>
      <string id="GCM_traceSecrets">Trace Secrets</string>
      <string id="GCM_traceSecrets_Explain">Enables tracing of secret and sensitive information, which is by default masked
in trace output. Requires that credential.trace is also enabled.

Corresponds to git config key: credential.traceSecrets</string>
      <string id="GCM_traceMsAuth">Trace Ms Auth</string>
      <string id="GCM_traceMsAuth_Explain">Enables inclusion of Microsoft Authentication library (MSAL) logs in GCM trace
output. Requires that credential.trace is also enabled.

Corresponds to git config key: credential.traceMsAuth</string>
      <string id="GCM_debug">Debug</string>
      <string id="GCM_debug_Explain">Pauses execution of GCM at launch to wait for a debugger to be attached.

Corresponds to git config key: credential.debug</string>
      <string id="GCM_provider">Provider</string>
      <string id="GCM_provider_Explain">Define the host provider to use when authenticating.

ID  Provider

auto (default)  [automatic] (learn more)
azure-repos  Azure Repos
github  GitHub
bitbucket  Bitbucket
gitlab  GitLab (supports OAuth in browser, personal access token and Basic Authentication)
generic  Generic (any other provider not listed above)

Automatic provider selection is based on the remote URL.

This setting is typically used with a scoped URL to map a particular set of
remote URLs to providers, for example to mark a host as a GitHub Enterprise
instance.

Corresponds to git config key: credential.provider</string>
      <string id="GCM_authority">Authority</string>
      <string id="GCM_authority_Explain">DEPRECATED. This setting is deprecated and should be replaced by credential.provider
with the corresponding provider ID value.

See the migration guide for more information.

Select the host provider to use when authenticating by which authority is
supported by the providers.

Authority  Provider(s)

auto (default)  [automatic]
msa, microsoft, microsoftaccount, aad, azure, azuredirectory, live, liveconnect, liveid  Azure Repos (supports Microsoft Authentication)
github  GitHub (supports GitHub Authentication)
bitbucket  Bitbucket.org (supports Basic Authentication and OAuth), Bitbucket Server (supports Basic Authentication)
gitlab  GitLab (supports OAuth in browser, personal access token and Basic Authentication)
basic, integrated, windows, kerberos, ntlm, tfs, sso  Generic (supports Basic and Windows Integrated Authentication)

Corresponds to git config key: credential.authority</string>
      <string id="GCM_guiPrompt">Gui Prompt</string>
      <string id="GCM_guiPrompt_Explain">Permit or disable GCM from presenting GUI prompts. If an equivalent terminal/
text-based prompt is available, that will be shown instead.

To disable all interactivity see credential.interactive.

Corresponds to git config key: credential.guiPrompt</string>
      <string id="GCM_guiSoftwareRendering">Gui Software Rendering</string>
      <string id="GCM_guiSoftwareRendering_Explain">Force the use of software rendering for GUI prompts.

This is currently only applicable on Windows.

Corresponds to git config key: credential.guiSoftwareRendering</string>
      <string id="GCM_allowUnsafeRemotes">Allow Unsafe Remotes</string>
      <string id="GCM_allowUnsafeRemotes_Explain">Allow transmitting credentials to unsafe remote URLs such as unencrypted HTTP
URLs. This setting is not recommended for general use and should only be used
when necessary.

Defaults false (disallow unsafe remote URLs).

Corresponds to git config key: credential.allowUnsafeRemotes</string>
      <string id="GCM_autoDetectTimeout">Auto Detect Timeout</string>
      <string id="GCM_autoDetectTimeout_Explain">Set the maximum length of time, in milliseconds, that GCM should wait for a
network response during host provider auto-detection probing.

See auto-detection for more information.

Note: Use a negative or zero value to disable probing altogether.

Defaults to 2000 milliseconds (2 seconds).

Corresponds to git config key: credential.autoDetectTimeout</string>
      <string id="GCM_allowWindowsAuth">Allow Windows Auth</string>
      <string id="GCM_allowWindowsAuth_Explain">Allow detection of Windows Integrated Authentication (WIA) support for generic
host providers. Setting this value to false will prevent the use of WIA and
force a basic authentication prompt when using the Generic host provider.

Note: WIA is only supported on Windows.

Note: WIA is an umbrella term for NTLM and Kerberos (and Negotiate).

Value  WIA detection

true (default)  Permitted
false  Not permitted

Corresponds to git config key: credential.allowWindowsAuth</string>
      <string id="GCM_httpProxy">Http Proxy</string>
      <string id="GCM_httpProxy_Explain">DEPRECATED. This setting is deprecated and should be replaced by the
standard http.proxy Git configuration option.

See HTTP Proxy for more information.

Configure GCM to use the a proxy for network operations.

Note: Git itself does not respect this setting; this affects GCM only.

Corresponds to git config key: credential.httpProxy</string>
      <string id="GCM_bitbucketAuthModes">Bitbucket Auth Modes</string>
      <string id="GCM_bitbucketAuthModes_Explain">Override the available authentication modes presented during Bitbucket
authentication. If this option is not set, then the available authentication
modes will be automatically detected.

Note: This setting only applies to Bitbucket.org, and not Server or DC
instances.

Note: This setting supports multiple values separated by commas.

Value  Authentication Mode

(unset)  Automatically detect modes
oauth  OAuth-based authentication
basic  Basic/PAT-based authentication

Corresponds to git config key: credential.bitbucketAuthModes</string>
      <string id="GCM_bitbucketAlwaysRefreshCredentials">Bitbucket Always Refresh Credentials</string>
      <string id="GCM_bitbucketAlwaysRefreshCredentials_Explain">Forces GCM to ignore any existing stored Basic Auth or OAuth access tokens and
always run through the process to refresh the credentials before returning them
to Git.

This is especially relevant to OAuth credentials. Bitbucket.org access tokens
expire after 2 hours, after that the refresh token must be used to get a new
access token.

Enabling this option will improve performance when using Oauth2 and interacting
with Bitbucket.org if, on average, commits are done less frequently than every
2 hours.

Enabling this option will decrease performance when using Basic Auth by
requiring the user the re-enter credentials every time.

Value  Refresh Credentials Before Returning

true, 1, yes, on   Always
false, 0, no, off_(default)_  Only when the credentials are found to be invalid

Corresponds to git config key: credential.bitbucketAlwaysRefreshCredentials</string>
      <string id="GCM_bitbucketValidateStoredCredentials">Bitbucket Validate Stored Credentials</string>
      <string id="GCM_bitbucketValidateStoredCredentials_Explain">Forces GCM to validate any stored credentials before returning them to Git. It
does this by calling a REST API resource that requires authentication.

Disabling this option reduces the HTTP traffic within GCM when it is retrieving
credentials. This may improve user performance, but will increase the number of
times Git remote calls fail to authenticate with the host and therefore require
the user to re-try the Git remote call.

Enabling this option helps ensure Git is always provided with valid credentials.

Value  Validate credentials

true, 1, yes, on_(default)_  Always
false, 0, no, off  Never

Corresponds to git config key: credential.bitbucketValidateStoredCredentials</string>
      <string id="GCM_bitbucketDataCenterOAuthClientId">Bitbucket Data Center OAuth Client Id</string>
      <string id="GCM_bitbucketDataCenterOAuthClientId_Explain">To use OAuth with Bitbucket DC it is necessary to create an external, incoming
AppLink.

It is then necessary to configure the local GCM installation with both the OAuth
ClientId and
ClientSecret from
the AppLink.

Corresponds to git config key: credential.bitbucketDataCenterOAuthClientId</string>
      <string id="GCM_bitbucketDataCenterOAuthClientSecret">Bitbucket Data Center OAuth Client Secret</string>
      <string id="GCM_bitbucketDataCenterOAuthClientSecret_Explain">To use OAuth with Bitbucket DC it is necessary to create an external, incoming
AppLink.

It is then necessary to configure the local GCM installation with both the OAuth
ClientId and
ClientSecret
from the AppLink.

Corresponds to git config key: credential.bitbucketDataCenterOAuthClientSecret</string>
      <string id="GCM_gitHubAccountFiltering">Git Hub Account Filtering</string>
      <string id="GCM_gitHubAccountFiltering_Explain">Enable or disable automatic account filtering for GitHub based on server hints
when there are multiple available accounts. This setting is only applicable to
GitHub.com with Enterprise Managed Users.

Value  Description

true (default)  Filter available accounts based on server hints.
false  Show all available accounts.

Corresponds to git config key: credential.gitHubAccountFiltering</string>
      <string id="GCM_gitHubAuthModes">Git Hub Auth Modes</string>
      <string id="GCM_gitHubAuthModes_Explain">Override the available authentication modes presented during GitHub
authentication. If this option is not set, then the available authentication
modes will be automatically detected.

Note: This setting supports multiple values separated by commas.

Value  Authentication Mode

(unset)  Automatically detect modes
oauth  Expands to: browser, device
browser  OAuth authentication via a web browser (requires a GUI)
device  OAuth authentication with a device code
basic  Basic authentication using username and password
pat  Personal Access Token (pat)-based authentication

Corresponds to git config key: credential.gitHubAuthModes</string>
      <string id="GCM_gitLabAuthModes">Git Lab Auth Modes</string>
      <string id="GCM_gitLabAuthModes_Explain">Override the available authentication modes presented during GitLab
authentication. If this option is not set, then the available authentication
modes will be automatically detected.

Note: This setting supports multiple values separated by commas.

Value  Authentication Mode

(unset)  Automatically detect modes
browser  OAuth authentication via a web browser (requires a GUI)
basic  Basic authentication using username and password
pat  Personal Access Token (pat)-based authentication

Corresponds to git config key: credential.gitLabAuthModes</string>
      <string id="GCM_namespace">Namespace</string>
      <string id="GCM_namespace_Explain">Use a custom namespace prefix for credentials read and written in the OS
credential store. Credentials will be stored in the format
{namespace}:{service}.

Defaults to the value git.

Corresponds to git config key: credential.namespace</string>
      <string id="GCM_credentialStore">Credential Store</string>
      <string id="GCM_credentialStore_Explain">Select the type of credential store to use on supported platforms.

Default value on Windows is wincredman, on macOS is keychain, and is unset
on Linux.

Note: See more information about configuring secret stores in
cred-stores.

Value  Credential Store  Platforms

(unset)  Windows: wincredman, macOS: keychain, Linux: (none)  -
wincredman  Windows Credential Manager (not available over SSH).  Windows
dpapi  DPAPI protected files. Customize the DPAPI store location with credential.dpapiStorePath  Windows
keychain  macOS Keychain.  macOS
secretservice  freedesktop.org Secret Service API via libsecret (requires a graphical interface to unlock secret collections).  Linux
gpg  Use GPG to store encrypted files that are compatible with the pass (requires GPG and pass to initialize the store).  macOS, Linux
cache  Git's built-in credential cache.  macOS, Linux
plaintext  Store credentials in plaintext files (UNSECURE). Customize the plaintext store location with credential.plaintextStorePath.  Windows, macOS, Linux
none  Do not store credentials via GCM.  Windows, macOS, Linux

Corresponds to git config key: credential.credentialStore</string>
      <string id="GCM_cacheOptions">Cache Options</string>
      <string id="GCM_cacheOptions_Explain">Pass options to the Git credential cache when
credential.credentialStore
is set to cache. This allows you to select a different amount
of time to cache credentials (the default is 900 seconds) by passing
"--timeout &lt;seconds&gt;". Use of other options like --socket is untested
and unsupported, but there's no reason it shouldn't work.

Defaults to empty.

Corresponds to git config key: credential.cacheOptions</string>
      <string id="GCM_plaintextStorePath">Plaintext Store Path</string>
      <string id="GCM_plaintextStorePath_Explain">Specify a custom directory to store plaintext credential files in when
credential.credentialStore is set to plaintext.

Defaults to the value ~/.gcm/store or %USERPROFILE%\.gcm\store.

Corresponds to git config key: credential.plaintextStorePath</string>
      <string id="GCM_dpapiStorePath">Dpapi Store Path</string>
      <string id="GCM_dpapiStorePath_Explain">Specify a custom directory to store DPAPI protected credential files in when
credential.credentialStore is set to dpapi.

Defaults to the value %USERPROFILE%\.gcm\dpapi_store.

Corresponds to git config key: credential.dpapiStorePath</string>
      <string id="GCM_gpgPassStorePath">Gpg Pass Store Path</string>
      <string id="GCM_gpgPassStorePath_Explain">Specify a custom directory to store GPG-encrypted pass-compatible credential files
in when credential.credentialStore is set to gpg.

Defaults to the value ~/.password-store or %USERPROFILE%\.password-store.

Corresponds to git config key: credential.gpgPassStorePath</string>
      <string id="GCM_msauthFlow">Msauth Flow</string>
      <string id="GCM_msauthFlow_Explain">Specify which authentication flow should be used when performing Microsoft
authentication and an interactive flow is required.

Defaults to auto.

Note: If credential.msauthUseBroker is set
to true and the operating system authentication broker is available, all flows
will be delegated to the broker. If both of those things are true, then the
value of credential.msauthFlow has no effect.

Value  Authentication Flow

auto (default)  Select the best option depending on the current environment and platform.
embedded  Show a window with embedded web view control.
system  Open the user's default web browser.
devicecode  Show a device code.

Corresponds to git config key: credential.msauthFlow</string>
      <string id="GCM_msauthUseBroker">Msauth Use Broker</string>
      <string id="GCM_msauthUseBroker_Explain">Use the operating system account manager where available.

Defaults to false. In certain cloud hosted environments when using a work or
school account, such as Microsoft DevBox, the default is true.

These defaults are subject to change in the future.

_Note: before you enable this option on Windows, please review the
Windows Broker details for what this means to your local Windows user
account._

Value  Description

true  Use the operating system account manager as an authentication broker.
false (default)  Do not use the broker.

Corresponds to git config key: credential.msauthUseBroker</string>
      <string id="GCM_msauthUseDefaultAccount">Msauth Use Default Account</string>
      <string id="GCM_msauthUseDefaultAccount_Explain">Use the current operating system account by default when the broker is enabled.

Defaults to false. In certain cloud hosted environments when using a work or
school account, such as Microsoft DevBox, the default is true.

These defaults are subject to change in the future.

Value  Description

true  Use the current operating system account by default.
false (default)  Do not assume any account to use by default.

Corresponds to git config key: credential.msauthUseDefaultAccount</string>
      <string id="GCM_useHttpPath">Use Http Path</string>
      <string id="GCM_useHttpPath_Explain">Tells Git to pass the entire repository URL, rather than just the hostname, when
calling out to a credential provider. (This setting
comes from Git itself, not GCM.)

Defaults to false.

Note: GCM sets this value to true for dev.azure.com (Azure Repos) hosts
after installation by default.

This is because dev.azure.com alone is not enough information to determine the
correct Azure authentication authority - we require a part of the path. The
fallout of this is that for dev.azure.com remote URLs we do not support
storing credentials against the full-path. We always store against the
dev.azure.com/org-name stub.

In order to use Azure Repos and store credentials against a full-path URL, you
must use the org-name.visualstudio.com remote URL format instead.

Value  Git Behavior

false (default)  Git will use only user and hostname to look up credentials.
true  Git will use the full repository URL to look up credentials.

Corresponds to git config key: credential.useHttpPath</string>
      <string id="GCM_azreposCredentialType">Azrepos Credential Type</string>
      <string id="GCM_azreposCredentialType_Explain">Specify the type of credential the Azure Repos host provider should return.

Defaults to the value pat. In certain cloud hosted environments when using a
work or school account, such as Microsoft DevBox, the default value is
oauth.

Value  Description

pat  Azure DevOps personal access tokens
oauth  Microsoft identity OAuth tokens (AAD or MSA tokens)

Here is more information about Azure Access tokens.

Corresponds to git config key: credential.azreposCredentialType</string>
      <string id="GCM_azreposManagedIdentity">Azrepos Managed Identity</string>
      <string id="GCM_azreposManagedIdentity_Explain">Use a Managed Identity to authenticate with Azure Repos.

The value system will tell GCM to use the system-assigned Managed Identity.

To specify a user-assigned Managed Identity, use the format id://{clientId}
where {clientId} is the client ID of the Managed Identity. Alternatively any
GUID-like value will also be interpreted as a user-assigned Managed Identity
client ID.

To specify a Managed Identity associated with an Azure resource, you can use the
format resource://{resourceId} where {resourceId} is the ID of the resource.

For more information about managed identities, see the Azure DevOps
documentation.

Value  Description

system  System-Assigned Managed Identity
[guid]  User-Assigned Managed Identity with the specified client ID
id://[guid]  User-Assigned Managed Identity with the specified client ID
resource://[guid]  User-Assigned Managed Identity for the associated resource

Also see: GCM_AZREPOS_MANAGEDIDENTITY

Corresponds to git config key: credential.azreposManagedIdentity</string>
      <string id="GCM_azreposServicePrincipal">Azrepos Service Principal</string>
      <string id="GCM_azreposServicePrincipal_Explain">Specify the client and tenant IDs of a service principal
to use when performing Microsoft authentication for Azure Repos.

The value of this setting should be in the format: {tenantId}/{clientId}.

You must also set at least one authentication mechanism if you set this value:

- credential.azreposServicePrincipalSecret
- credential.azreposServicePrincipalCertificateThumbprint
- credential.azreposServicePrincipalCertificateSendX5C

For more information about service principals, see the Azure DevOps
documentation.

Corresponds to git config key: credential.azreposServicePrincipal</string>
      <string id="GCM_azreposServicePrincipalSecret">Azrepos Service Principal Secret</string>
      <string id="GCM_azreposServicePrincipalSecret_Explain">Specifies the client secret for the service principal when
performing Microsoft authentication for Azure Repos with
credential.azreposServicePrincipalSecret set.

Corresponds to git config key: credential.azreposServicePrincipalSecret</string>
      <string id="GCM_azreposServicePrincipalCertificateThumbprint">Azrepos Service Principal Certificate Thumbprint</string>
      <string id="GCM_azreposServicePrincipalCertificateThumbprint_Explain">Specifies the thumbprint of a certificate to use when authenticating as a
service principal for Azure Repos when
GCM_AZREPOS_SERVICE_PRINCIPAL is set.

Corresponds to git config key: credential.azreposServicePrincipalCertificateThumbprint</string>
      <string id="GCM_azreposServicePrincipalCertificateSendX5C">Azrepos Service Principal Certificate Send X5 C</string>
      <string id="GCM_azreposServicePrincipalCertificateSendX5C_Explain">When using a certificate for service principal authentication, this configuration
specifies whether the X5C claim should be should be sent to the STS. Sending the x5c
enables application developers to achieve easy certificate rollover in Azure AD:
this method will send the public certificate to Azure AD along with the token request,
so that Azure AD can use it to validate the subject name based on a trusted issuer
policy. This saves the application admin from the need to explicitly manage the
certificate rollover. For details see https://aka.ms/msal-net-sni.

Corresponds to git config key: credential.azreposServicePrincipalCertificateSendX5C</string>
      <string id="GCM_trace2_normalTarget">Normal Target</string>
      <string id="GCM_trace2_normalTarget_Explain">Turns on Trace2 Normal Format tracing - see Git's Trace2 Normal Format
documentation for more details.

Corresponds to git config key: trace2.normalTarget</string>
      <string id="GCM_trace2_eventTarget">Event Target</string>
      <string id="GCM_trace2_eventTarget_Explain">Turns on Trace2 Event Format tracing - see Git's Trace2 Event Format
documentation for more details.

Corresponds to git config key: trace2.eventTarget</string>
      <string id="GCM_trace2_perfTarget">Perf Target</string>
      <string id="GCM_trace2_perfTarget_Explain">Turns on Trace2 Performance Format tracing - see Git's Trace2 Performance
Format documentation for more details.

Corresponds to git config key: trace2.perfTarget</string>
    </stringTable>
  </resources>
</policyDefinitionResources>